exports.typeDef = `
  """
  카드사 및 은행 기타등등에 대한 항목을 가져올 수 있습니다.
  """
  type Setting {
    card: [String]
    bank: [String]
  }

  extend type Query {
    findSetting: Setting
  }
`

exports.resolvers = {
  Query: {
    findSetting (root, args, ctx) {
      return {
        card: cardArr,
        bank: bankArr
      }
    }
  }
}

const cardArr = [
  '신한카드',
  '삼성카드',
  '비씨카드',
  'KB국민카드',
  '현대카드',
  '우리(구 평화)카드',
  '롯데(아멕스)카드',
  '하나카드',
  '시티은행(구 한미은행)카드',
  '외환카드',
  'IBK(기업)카드',
  '농협NH카드',
  '강원은행카드',
  '광주은행카드',
  '부산은행카드',
  '산업은행카드',
  '수협은행카드',
  '저축은행카드',
  '전북은행카드',
  '제주은행카드'
]

const bankArr = [
  '국민은행',
  '우리은행',
  '기업은행',
  '농협은행',
  '신한은행',
  '하나은행',
  '한국씨티은행',
  'SC제일은행',
  '카카오뱅크',
  '케이뱅크',
  '경남은행',
  '광주은행',
  '대구은행',
  '도이치은행',
  '부산은행',
  // '비엔피파리바은행',
  // '산림조합',
  '산업은행',
  '새마을금고',
  // '수출입은행',
  '수협은행',
  '신협',
  '우체국',
  '저측은행',
  '전북은행',
  '제주은행',
  '중국건설은행',
  '중국공상은행',
  'BOA(뱅크오브아메리카)',
  'HSBC은행',
  'JP모간체이스은행'
]